cardOBJ = [
[0,0,"无",0,0],
[1,1,"全种族+20%",0,30,20,31,20,32,20,33,20,34,20,35,20,36,20,37,20,38,20,39,20,0],
[2,1,"全属性+20%",0,40,20,41,20,42,20,43,20,44,20,45,20,46,20,47,20,48,20,49,20,0],
[3,1,"全体型15% Atk+5",0,17,5,27,15,28,15,29,15,0],
[4,1,"绿棉虫卡",0,3,1,13,100,0],
[5,1,"土波利卡",0,5,1,8,3,0],
[6,1,"蜂兵卡",0,1,1,17,3,0],
[7,1,"疯兔卡",0,6,1,10,1,11,1,0],
[8,1,"浮勒盗虫卡",0,2,1,9,1,0],
[9,1,"邪骸战士卡",0,17,10,131,2,0],
[10,1,"狼卡",0,17,15,10,1,0],
[11,1,"白蚁卡",0,17,20,0],
[12,1,"大嘴鸟蛋卡",0,30,20,0],
[13,1,"海葵卡",0,37,20,0],
[14,1,"哥布灵卡",0,32,20,0],
[15,1,"刺猬虫卡",0,34,20,0],
[16,1,"蝎子卡",0,33,20,0],
[17,1,"噬人花卡",0,35,20,0],
[18,1,"海神卡",0,36,20,0],
[19,1,"毕帝特地龙卡",0,39,20,0],
[20,1,"狄奥斯卡",0,37,7,32,7,33,7,34,7,0],
[21,1,"红蝙蝠卡",0,41,20,0],
[22,1,"圣诞波利卡",0,47,20,0],
[23,1,"曼陀萝魔花卡",0,44,20,0],
[24,1,"螃蟹卡",0,43,20,0],
[25,1,"毒蛇卡",0,45,20,0],
[26,1,"卡浩卡",0,42,20,0],
[27,1,"邪骸兽人卡",0,46,20,0],
[28,1,"沙漠之狼卡",0,27,15,17,5,0],
[29,1,"邪骸矿工卡",0,28,15,17,5,0],
[30,1,"米洛斯卡",0,29,15,17,5,0],
[31,1,"深渊骑士卡",0,26,25,0],
[32,1,"海盗之王卡","武器的攻击力将不会被魔物体型减少。",0],
[33,1,"漂浮虫卡",0,17,5,135,5,0],
[34,1,"青蛇卡",0,17,5,130,5,0],
[35,1,"水母卡",0,17,5,132,5,0],
[36,1,"重金属蝗虫卡",0,17,5,136,5,0],
[37,1,"魔锅蛋卡",0,17,5,133,5,0],
[38,1,"兹诺克卡",0,17,10,130,4,0],
[39,1,"巨石怪卡","武器不被攻击损坏。",17,5,0],
[40,1,"木乃伊卡",0,8,20,0],
[41,1,"邪骸士兵卡",0,10,9,0],
[42,1,"死灵卡",0,12,10,0],
[43,1,"黑蛇卡","附加[二刀连击],Lv1。(所有武器)<BR>(习得二刀连击Lv2以上时，则按照所习得等击发动)",0],
[44,1,"皮里恩卡",0,8,100,0],
[45,1,"巴风特卡","普攻时，3x3范围内给予范围伤害。",8,-10,0],
[46,1,"赤苍蝇卡","物理攻击时，增加3%机率吸收等于15%攻击伤害的HP。<BR>(这个部份将不计算)",0],
[47,1,"德古拉伯爵卡","物理攻击时，增加10%机率吸收等于5%攻击伤害的SP。<BR>(这个部份将不计算)",0],
[48,2,"树精卡",0,14,80,0],
[49,2,"长老树精卡",0,4,2,0],
[50,2,"梦魇卡",0,2,1,155,100,0],
[51,2,"小恶魔卡",0,1,1,154,100,0],
[52,2,"兽人英雄卡",0,3,3,151,100,0],
[53,3,"盗虫卵卡",0,13,400,0],
[54,3,"蚁卵卡",0,15,5,0],
[55,3,"蜗牛卡",0,18,2,0],
[56,3,"突变蛙卡",0,57,30,0],
[57,3,"兽人战士卡",0,52,30,0],
[58,3,"大脚熊卡",0,54,30,0],
[59,3,"草精卡",0,55,30,0],
[60,3,"毕帝特飞龙卡",0,59,30,0],
[61,3,"卡利斯格卡",0,56,30,0],
[62,3,"锹形虫卡",0,78,35,0],
[63,3,"米杜莎卡",0,56,15,159,100,0],
[64,4,"波利卡",0,6,2,11,1,0],
[65,4,"小鸡卡",0,1,1,17,10,0],
[66,4,"蛋壳小鸡卡",0,3,1,13,100,0],
[67,4,"盗虫卡",0,2,1,0],
[68,4,"蝗虫卡",0,5,1,17,5,0],
[69,4,"沙漠幼狼卡",0,4,1,0],
[70,4,"野猪卡",0,3,3,0],
[71,4,"虫蛹卡",0,13,700,0],
[72,4,"罗达蛙卡",0,13,400,14,50,0],
[73,4,"大嘴鸟卡",0,15,10,0],
[74,4,"绿苍蝇卡",0,18,2,64,10,0],
[75,4,"暗神官卡",0,4,1,18,1,198,9,0],
[76,5,"白幽灵卡",0,9,20,68,-50,0],
[77,5,"幽灵剑士卡",0,60,20,0],
[78,5,"小巴风特卡",0,2,3,10,1,0],
[79,5,"秃鹰卡",0,9,10,0],
[80,5,"猎蝇卡",0,9,5,64,30,0],
[81,5,"乌贼卡",0,9,5,61,30,0],
[82,5,"南瓜先生卡",0,9,5,63,30,0],
[83,5,"蚯蚓卡",0,9,5,62,30,0],
[84,5,"傀儡娃娃卡",0,9,5,68,30,0],
[85,5,"兽人腐尸卡",0,9,5,69,30,0],
[86,5,"蛇女伊丝卡",0,9,5,67,30,0],
[87,5,"麦斯特卡",0,9,5,65,30,0],
[88,6,"苍蝇卡",0,9,2,2,1,0],
[89,6,"玛勒盗虫卡",0,2,2,0],
[90,6,"黑狐卡",0,2,1,15,10,0],
[91,6,"鬼女卡",0,16,15,76,3,0],
[92,6,"木乃伊犬卡",0,15,8,16,8,0],
[93,6,"腐尸卡",0,75,20,0],
[94,6,"转转蛋卡",0,76,15,0],
[95,6,"虎王卡","无限[霸体]",15,-25,0],
[96,7,"魔菇卡",0,3,2,0],
[97,7,"库克雷卡",0,2,2,0],
[98,7,"白鼠卡",0,1,2,0],
[99,7,"森灵卡",0,5,2,0],
[100,7,"杰洛米卡",0,5,3,0],
[101,7,"螳螂卡",0,1,3,0],
[102,7,"溜溜猴卡",0,2,1,11,5,0],
[103,7,"犬妖卡",0,1,1,10,4,0],
[104,7,"摩卡卡",0,75,10,0],
[105,7,"剑鱼卡","咏唱时间增加25%。咏唱不会被中断。(城战无效)。",73,25,0],
[106,1,"星星的角(1级强悍)",0,0],
[107,1,"邪骸弓箭手卡",0,25,10,0],
[108,10,"蝎子之王卡",0,0],
[109,1,"小野猪卡",0,131,5,0],
[110,1,"吸血蝙蝠卡",0,17,5,134,5,0],
[111,1,"诺可伊卡",0,137,5,0],
[112,10,"白蚁幼虫卡",0,4,1,0],
[113,2,"瓢虫卡",0,18,1,156,20,0],
[114,2,"松鼠卡",0,18,1,155,20,0],
[115,2,"土拨鼠卡",0,18,1,154,20,0],
[116,2,"绿腐尸卡",0,18,1,150,20,0],
[117,2,"基尔瑟卡",0,157,100,62,15,0],
[118,2,"马尔杜克卡",0,156,100,0],
[119,2,"蜂后卡","使用技能时SP消耗量增加25%。<BR>使需要魔力矿石才能施展的魔法，各种魔力矿石的消耗量节省一颗。",0],
[120,2,"法老王卡","减少技能消耗SP30%。",0],
[121,10,"战蚁卡",0,0],
[122,3,"安毕斯卡",0,58,30,0],
[123,3,"邪骸食人鱼卡",0,18,1,152,20,0],
[124,3,"艾斯蜘蛛卡",0,18,1,159,20,0],
[125,3,"僵尸卡",0,18,1,62,5,159,15,0],
[126,3,"黄金虫卡","受到的攻击魔法、辅助魔法无效化。<BR>增加技能使用时SP消耗量100%。",0],
[127,3,"蚁后卡","50%机率反射单体魔法攻击。反射时不受损伤。",0],
[128,4,"异变鱼卡",0,18,1,198,1,0],
[129,4,"泥人卡",0,18,1,198,2,0],
[130,4,"帕莎那卡",0,18,1,198,3,0],
[131,4,"土人卡",0,18,1,198,4,0],
[132,4,"卡那多斯卡","铠甲不被攻击损坏。",18,1,0],
[133,4,"艾吉欧蜈蚣卡",0,18,1,198,5,0],
[134,4,"天使波利卡",0,198,6,0],
[135,4,"巫婆卡",0,198,7,0],
[136,4,"幽灵波利卡",0,198,8,75,-25,0],
[137,4,"马克卡",0,152,100,61,5,0],
[138,4,"兽人酋长卡","近距离物理攻击反射30%。反射时仍然受100%损伤。",0],
[139,5,"伞蜥蜴卡",0,230,108201,0],
[140,6,"月夜猫卡","无时限移动加速25%。",0],
[141,7,"贝雷杰卡",0,73,-30,0],
[142,7,"毒魔菇卡",0,220,101703,0],
[143,7,"气泡虫卡",0,220,100703,0],
[144,7,"黑蚁卡","使用技能时SP消耗量增加25%。附加技能[治愈术Lv1],。",220,102501,0],
[145,7,"狸猫卡",0,230,101601,0],
[146,7,"克瑞米卡",0,230,103501,0],
[147,7,"波波利卡",0,230,101801,0],
[148,7,"人鱼卡",0,230,102601,0],
[149,7,"邪骸海盗卡",0,230,106005,0],
[150,7,"鬼火卡",0,230,105001,0],
[151,7,"裘卡卡",0,230,101501,0],
[152,7,"俄塞里斯卡","复活时HP与SP完全恢复。",0],
[153,10,"",0,0],
[154,3,"全种族耐性+30%",0,50,30,51,30,52,30,53,30,54,30,55,30,56,30,57,30,58,30,59,30,0],
[155,10,"",0,0],
[156,1,"爆击攻击+10% 爆击率+7",0,70,10,10,7,0],
[157,1,"金属波利卡",0,231,19817201,0],
[158,1,"暗●十字刺客卡",0,117,10,0],
[159,1,"暗●神工匠卡",0,8,30,12,-5,0],
[160,1,"暗●神射手卡",0,12,5,8,-30,0],
[161,1,"暗●神工匠哈沃得卡","物理攻击时、10%の确率で武器破坏、7%の确率で防具破坏",0],
[162,1,"暗●神射手迪文卡","物理攻击时、5%の确率で敌に与えたダメージの20%ほどHP回复",75,-100,0],
[163,1,"微风卡",0,17,5,138,5,0],
[164,1,"慰劳者","装备者がプリーストである场合<BR>物理攻击时、低确率でオートスペル[グランドクロス]Lv5发动",0],
[165,1,"达纳托斯的悲哀卡",0,17,5,231,19802803,0],
[166,1,"魔剑士达纳托斯的记忆卡","攻击する度にSP10消费",23,1,85,30,9,-30,0],
[167,1,"希尔士兵卡","装备解除时、SP-50",5057,5,5126,5,5127,5,0],
[168,1,"暗●魔法师卡","装备解除时、SP-50",5130,3,5131,3,0],
[169,1,"死亡魔书卡","装备解除时、SP-50",5046,5,5057,5,5277,5,0],
[170,1,"红贝勒斯卡","装备解除时、SP-50",5122,5,5125,5,0],
[171,1,"矿工魔卡","装备解除时、SP-50",5132,5,5133,5,0],
[172,3,"玩偶熊卡",0,51,30,0],
[173,3,"达纳托斯的绝望卡","精炼值によりINTが增加",4,-6,0],
[174,2,"温古力安特卡",0,75,10,158,100,0],
[175,2,"摩尔卡",0,6,2,0],
[176,2,"双子星-S58卡","AGIが90以上の场合、沈默、スタンに対する耐性+30%<BR>VITが80以上の场合、石化、睡眠に対する耐性+50%",0],
[177,2,"暗●超魔导师卡","精炼值1每に咏唱时间-1%<BR>精炼值が9以上の时、MATK 2%增加",0],
[178,2,"暗●骑士领主赛依连卡","[バーサーク]Lv1使用可能(计算机未导入)",15,-50,0],
[179,2,"灰俄希托斯卡","精炼值が4以下の时、さらに最大SP+40、SP自然回复量+5%",14,40,0],
[180,2,"暗●骑士领主卡","精炼值によりSTRが增加",1,-6,0],
[181,4,"废铁暖炉卡",0,4,1,17,5,0],
[182,4,"毒液魔卡","物理攻击を受けた时、高确率で敌と自分に毒をかける",0],
[183,4,"三叶铁甲虫卡",0,17,25,18,-5,0],
[184,4,"矿石魔卡",0,17,-25,18,3,0],
[185,4,"黑曜石卡","补正值を除いたDEX18每にVIT+1",0],
[186,4,"消防魔卡","精炼值が高くなるほど最大HP增加量が减少す",13,800,0],
[187,4,"暗●剑士卡","补正值を除いたINT18每にSTR+1",0],
[188,4,"暗●商人卡","鱼类型モンスターを倒す度に、一定确率で贝のスープ(VIT+3)を落とす",0],
[189,4,"红凡娜图卡","补正值を除いたAGI18每にLUK+1",0],
[190,4,"阿克坦卡",0,17,10,73,20,0],
[191,4,"狂暴邪恶箱卡","补正值を除いたLUK18每にAGI+1",0],
[192,4,"诺博斯卡","物理攻撃を受けた時、高確率で敵と自分に混乱をかける",0],
[193,4,"黄诺博斯卡",0,13,500,75,10,0],
[194,4,"爱丽削卡",0,9,10,18,-5,0],
[195,4,"皮影魔卡","物理攻击を受けた时、高确率で敌と自分に出血をかける",0],
[196,4,"安息者卡","补正值を除いたSTR18每にINT+1",0],
[197,4,"监视者卡","补正值を除いたVIT18每にDEX+1",0],
[198,4,"迪靡克卡","精炼值によりVITが增加",3,-5,0],
[199,4,"彩妆皮影魔卡","精炼值の2倍、魔法反射确率增加。<BR>マジシャン系列が装备时、追加でMDEF+3",0],
[200,10,"",0,0],
[201,10,"水属性石",0,0],
[202,10,"土属性石",0,0],
[203,10,"火属性石",0,0],
[204,10,"风属性石",0,0],
[205,10,"预备",0,0],
[206,10,"预备",0,0],
[207,10,"预备",0,0],
[208,10,"预备",0,0],
[209,10,"预备",0,0],
[210,10,"预备",0,0],
[211,10,"预备",0,0],
[212,7,"万圣魔卡","初心者或超级初心者受到物理伤害后，(10%)机率施展：加速术Lv1。",0],
[213,2,"鬼娃树卡","上段头饰精炼度5以下时，MDEF+5",0],
[214,4,"假面鬼卡","受到物理伤害后，5％机率让敌人受到沉默。<BR>基本VIT77以上时，沉默机率改为15％。",0],
[215,1,"无颅武士卡",0,70,10,119,7,0],
[216,7,"兔斯拉卡","给予敌伤害后，0.4％机率将魔物变换成其它魔物。",0],
[217,1,"嗜血怪人卡",0,70,10,114,7,0],
[218,7,"南瓜魂卡","初心者或超级初心者受到物理伤害后，(20%)机率施展：霸体Lv1。",0],
[219,1,"死灵骑士卡","机率向敌对象施展即死术(COMA)。物理攻击命中对象时，机率昏眩、诅咒、沉默、中毒、出血。",0],
[220,4,"银月魔女卡","受到物理伤害后，5％机率对自己施展治愈术Lv3。",0],
[221,2,"圣天使波利卡","基本LUK77以上时，HP恢复量和axSP恢复量上升100%。",13,300,0],
[222,3,"卷甲虫卡","盾牌精炼度5以下时，DEF+2，MDEF+3",0],
[223,1,"风灵龟卡",0,70,10,117,7,0],
[224,4,"虎蜥人卡","习得心神凝聚Lv10时，改为使用Lv10的心神凝聚。",231,69804201,0],
[225,4,"阿修罗机械战士卡","铠甲精炼度9以上时，MaxHP+800",3,2,0],
[226,7,"豹皮怪卡","击倒天使种族时，机率额外掉落：阳光的箱子。",0],
[227,6,"狂暴小土人卡",0,127,10,57,-20,0],
[228,6,"古埃及王卡","基本INT99的角色装备时，机率改为30％。",7,1,231,69809810,0],
[229,6,"钟怪卡",0,3,1,13,300,0],
[230,7,"鳄鱼人卡",0,78,5,0],
[231,3,"爱丽丝女仆卡",0,77,40,79,-40,0],
[232,4,"邪恶老公公卡",0,231,69803501,0],
[233,1,"纸妖卡","给予敌伤害后，自己消耗sp1",70,20,0],
[234,2,"恶魔侍者卡",0,14,150,4,-3,76,-20,0],
[235,1,"邪恶使者卡",0,221,19808301,0],
[236,7,"薇欧莉卡","习得冷笑话Lv5时，改为使用冷笑话Lv5。",231,19820101,0],
[237,7,"风魔巫师卡","习得雷鸣术Lv10时，Lv3雷鸣术改为使用Lv10雷鸣术。",221,19812603,0],
[238,2,"伍坦弹弓手卡",0,18,1,157,20,0],
[239,2,"伍坦战士卡",0,18,1,158,20,0],
[240,4,"机木人卡",0,75,30,18,1,0],
[241,3,"行刑者卡",0,18,1,192,25,0],
[242,6,"爆炎蝙蝠卡",0,129,10,59,-20,0],
[243,5,"疯兔王卡",0,3,1,0],
[244,1,"邪灵魔导士卡","(攻城时，物理攻击对监护人魔物的伤害增加40%。)",1063,40,1064,40,1065,40,0],
[245,3,"狂暴木乃伊卡",0,231,69802905,0],
[246,6,"狂暴蜈蚣卡",0,126,10,56,-20,0],
[247,7,"鸮袅首领卡",0,231,19809003,0],
[248,7,"鸮袅男爵卡",0,231,19810301,0],
[249,3,"兽牙怪卡",0,18,1,191,25,0],
[250,7,"兽人弓箭手卡","击倒人类种族时，机率额外掉落：昏眩的箱子。",0],
[251,7,"牛蛙卡",0,221,19801701,0],
[252,1,"兽人女战士卡",0,83,30,0],
[253,1,"海豹宝宝卡","服事系列角色装备时，对恶魔种族和不死种族，Cri+9",8,10,9,3,0],
[254,1,"贝壳魔灵卡",0,1072,30,0],
[255,1,"元灵武士卡","无视一般阶级对象的防御力。<BR>装备者HP不会自动恢复，每10秒钟HP会损失666。<BR>装备解除时，HP会消耗999。",22,1,0],
[256,7,"蝙蝠弓箭手卡","击倒昆虫种族时，机率额外掉落：打雷的箱子。",0],
[257,6,"狂暴鬼火卡",0,123,10,53,-20,0],
[258,5,"钓鱼河童卡","披肩精炼度5以下时，MDEF+8",0],
[259,1,"卡拉蟹卡",0,1240,30,0],
[260,7,"火忍西怒毕卡","受到物理伤害后，机率施展：伪装(依照持有的Lv，但上限Lv5)。",2,1,0],
[261,4,"伞妖卡","受到物理伤害后，5％机率让敌人受到混乱。<BR>基本STR77以上时，混乱机率改为15％。",0],
[262,7,"啤酒企鹅卡","击倒昆虫种族时随机的掉落，苹果、香蕉、胡萝卜汁。",0],
[263,1,"沙漠毒蝎卡","使用近距离(武器或技能)的物理伤害，击倒昆虫种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[264,4,"凯美拉卡","受到物理伤害后，5％机率让敌人中毒。<BR>刺客系列装备时，机率改为15％。",0],
[265,1,"狂暴绿绵虫卡","使用近距离(武器或技能)的物理伤害，击倒植物种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[266,6,"狂暴月夜猫卡","5%机率反射单体魔法攻击。",19,3,0],
[267,5,"巨大白幽灵卡","基本STR80以上时，基本Atk+20。<BR>基本VIT80以上时，MaxHP+3%。<BR>基本LUK80以上时，Cri+3。",9,10,0],
[268,4,"狂暴螳螂卡","受到物理伤害后，10％机率让敌人受到出血。",0],
[269,6,"XMAS甜饼人卡",0,128,10,58,-20,0],
[270,7,"甜饼人卡",0,6,2,5037,10,5387,10,0],
[271,5,"九尾狐卡","披肩精炼度9以上时，FLEE+20。",2,2,0],
[272,3,"米糕卡","攻城时，从监护人魔物受到的所有伤害，减少50%。",3063,50,3064,50,3065,50,0],
[273,2,"蓝鼠卡","击倒魔物时，低机率(2%)得到0~500的Zeny。",0],
[274,2,"七彩大嘴鸟卡",0,231,69810001,0],
[275,4,"狂暴克瑞米卡","受到物理伤害后，10％机率让敌人受到混乱。",0],
[276,4,"暴焰野熊卡","受到物理伤害后，5％机率让敌人受到盲目。",0],
[277,1,"狮鹫兽卡","剑士系列角色装备，给予敌伤害后，1％机率对敌施展：怪物互击Lv5。",9,2,10,7,0],
[278,6,"狂暴野猪卡",0,125,10,55,-20,0],
[279,1,"玩具士兵卡",0,70,10,112,7,0],
[280,4,"古钟魔卡","习得自动防御Lv10时，改为使用自动防御Lv10。",231,69815703,0],
[281,4,"小花豹卡","商人系列角色装备时，铠甲不被攻击损坏。",6,3,0],
[282,4,"爱丽哲卡","物理攻击を受けた时、一定确率でオートスペル[魅惑のウィンク]发动<BR>装备者がダンサーである时、10%の确率で发动する",0],
[283,4,"魔羌卡","铠甲精炼度5以下时，DEF+2，MDEF+5。",0],
[284,2,"墨蛇君卡",0,4,3,154,100,153,100,0],
[285,4,"狂暴米诺斯卡","受到物理伤害后，10％机率让敌人昏眩。",0],
[286,1,"哥布灵弓手卡",0,70,10,111,7,0],
[287,1,"喷射哥布灵卡",0,70,10,110,7,0],
[288,1,"哥布灵首领卡",0,81,30,0],
[289,1,"犬妖弓手卡",0,70,10,113,7,0],
[290,1,"犬妖首领卡",0,82,30,0],
[291,4,"恶魔女仆卡",0,13,1000,3,-3,75,-20,0],
[292,7,"天狗卡","击倒魔物时，机率额外掉落恢复物品。(未实装)",0],
[293,4,"雪熊卡","受到物理伤害后，10％机率让敌人受到冰冻。",0],
[294,5,"流浪之狼卡",0,1,1,0],
[295,5,"邪骸浪人卡","盗贼系列角色装备时，Flee+20。",231,19817601,0],
[296,1,"三叶虫卡","使用近距离(武器或技能)的物理伤害，击倒无型种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[297,7,"海獭卡","击倒鱼贝种族时，机率额外掉落明虾寿司或是生鱼片。<BR>吃下明虾寿司或是生鱼片时，HP恢复量增加50%。",0],
[298,2,"卡拉特小丑卡","上段头饰精炼度9以上时，MaxSP+150",4,2,0],
[299,4,"克莱本卡","受到物理伤害后，10％机率让敌人陷入黑暗。",0],
[300,6,"邪骸战士长卡",0,124,10,54,-20,0],
[301,4,"邪恶向日葵卡","习得天使之赐福Lv10时，改为使用天使之赐福Lv10。",231,69803102,0],
[302,4,"狂暴蜘蛛卡","受到物理伤害后，10％机率让敌人中毒。",0],
[303,2,"狂暴蜂兵卡","击倒昆虫种族时，机率额外掉落风灵矿石。",64,10,0],
[304,6,"武士火枪兵卡","鞋子精炼度9以上时，MaxHP+10%，MaxSP+10%。",1,2,0],
[305,1,"卡仑宝宝卡","给予敌伤害后，8％机率施展：冰冻术Lv3。",0,221,19805503,0],
[306,3,"艾斯恩魔女卡",0,5207,10,5199,10,6,2,0],
[307,3,"猴桃木卡","给予敌伤害后，2％机率对自己使用治愈术Lv1。习得(抄袭不算)治愈术Lv10时，改为使用治愈术Lv10。",0],
[308,4,"邪骸战俘卡","受到物理伤害后，5％机率让敌人受到睡眠。",0],
[309,2,"钟乳巨石怪卡",0,18,1,151,20,0],
[310,3,"史汀卡","盾牌精炼度9以上时，MDEF+5。",18,2,0],
[311,1,"暗黑祭司卡","攻击时有低机率，让敌人SP减少。<BR>贤者或是智者装备时，每次攻击回复sp1。",0],
[312,7,"灰森灵卡","击倒动物种族时，机率额外掉落：暴雨的箱子。",0],
[313,1,"冰暴骑士卡",0,132,20,221,19813101,0],
[314,7,"弹簧兔卡","击倒动物种族时，机率额外掉落肉或是魔物饲料。<BR>吃下肉或是魔物饲料时，HP恢复量增加50%。",0],
[315,7,"沙妖卡","击倒鱼贝种族时，机率额外掉落：睡眠的箱子。",0],
[316,7,"贤者虫卡","击倒魔物时，机率额外掉落魔力矿石。",0],
[317,4,"岩石龟卡",0,18,2,19,2,0],
[318,6,"腐尸战俘卡",0,121,10,51,-20,0],
[319,1,"腐尸首领卡","使用近距离(武器或技能)的物理伤害，击倒不死种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[320,2,"迷幻之王卡",0,73,-10,15,-10,16,-10,0],
[321,4,"镜妖卡","受到物理伤害后，10％机率让敌人受到石化。",0],
[322,6,"黑暗之王卡",0,221,69812505,0],
[323,1,"乌龟将军卡","物理攻击时，对魔物增加20%的伤害。",80,20,221,19800710,0],
[324,7,"元宵童子卡","击倒人类种族时，机率额外掉落糖果或是柺杖糖。<BR>吃下糖果或是柺杖糖时，HP恢复量增加50%。",0],
[325,1,"魔灵娃娃卡","(对象为敌人而非自己)",221,19802505,0],
[326,1,"拉链熊卡","给予敌伤害后，自己消耗sp1。<BR>商人系列角色装备时，武器不被攻击损坏。",17,30,0],
[327,5,"巧克猴卡",0,9,10,11,5,0],
[328,1,"流氓卡","盗贼系列角色装备时，Cri+4。",70,15,0],
[329,1,"赤焰小恶魔卡","使用近距离(武器或技能)的物理伤害，击倒恶魔种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[330,4,"天邪鬼卡","受到物理伤害后，10％机率让敌人受到睡眠。",0],
[331,4,"狂暴恶灵卡","受到物理伤害后，10％机率让敌人受到诅咒。",0],
[332,2,"白素贞卡","ヒール、サンクチュアリ、ポーションピッチャーの回复量が 30% 增加する。<BR>消费SP 15% 增加",91,30,94,30,0],
[333,4,"七彩飞龙卡","HP恢复量减少100%。使用近距离(武器或技能)的物理伤害，击倒魔物时，HP恢复100。",0],
[334,4,"七彩地龙卡","使用近距离(武器或技能)的物理伤害，击倒魔物时，SP恢复10。装备解除时，SP消耗100。",0],
[335,7,"将军魔碑卡","给予敌伤害后，0.2％机率施展：蓄气Lv5。<BR>装备者是服事系列时，机率改为5％。<BR>装备者是枪手时，0.2％机率施展：弹硬币Lv1。有学习弹硬币时，使用学习的等级。",0],
[336,7,"恶云仙人卡","击倒植物种族时，机率额外掉落：忧郁的箱子。",0],
[337,2,"妖仙女卡",0,4,1,14,50,0],
[338,5,"蛙王卡",0,11,1,0],
[339,2,"钟塔守护者卡","咏唱时间减少5%",73,-5,4,1,0],
[340,5,"刺尾蜻蜓卡",0,5040,5,5041,5,2,1,9,10,0],
[341,5,"龙蝇卡",0,2,1,0],
[342,2,"森林妖姬卡","击倒植物种族时，机率额外掉落地灵矿石。",62,10,0],
[343,1,"爆钻伞蜥卡","使用近距离(武器或技能)的物理伤害，击倒龙类种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[344,4,"七彩梦魇卡","受到物理伤害后，5％机率让敌人受到诅咒。",0],
[345,1,"奈利虫卡","使用近距离(武器或技能)的物理伤害，击倒动物种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[346,5,"鸟人哈比卡",0,60,15,5046,5,0],
[347,2,"果树龟卡",0,67,15,69,15,0],
[348,3,"兽人战士长卡","近距离物理攻击反射5%。",18,1,0],
[349,4,"卡仑卡","受到物理伤害后，50%机率让敌人受到冰冻状态。",0],
[350,7,"血蝴蝶卡","咏唱不会被中断。(城战无效)。",73,30,5053,5,0],
[351,6,"人鱼士兵卡",0,75,10,76,10,0],
[352,5,"朽魔卡","习得泥沼地Lv5时，改为施展泥沼地Lv5。",231,69813401,0],
[353,1,"狂暴哥布灵卡",0,70,10,116,7,0],
[354,7,"火焰龟卡","剑士系列装备时，完全回避+3。",10,3,0],
[355,1,"巨象甲虫卡","使用近距离(武器或技能)的物理伤害，击倒鱼贝种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[356,1,"海星卡",0,1059,30,0],
[357,2,"基尔-D-01",0,74,30,0],
[358,3,"苗娃佩瑞丝卡",0,60,5,18,1,0],
[359,1,"伪天使卡","使用近距离(武器或技能)的物理伤害，击倒天使种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[360,1,"阿修罗狂战士卡","使用近距离(武器或技能)的物理伤害，击倒人类种族时，SP恢复5。<BR>装备解除时，SP减少5。",0],
[361,1,"血腥骑士卡",0,221,19812501,0],
[362,6,"水灵龟卡","鞋子精炼度9以上时，使用狂击时伤害增加10%。",13,300,0],
[363,1,"巴基力兰特克力斯卡","武器が损伤されない。<BR>物理ダメージ 10% 增加。",231,11023901,0],
[364,4,"伊特瓢虫卡","受到物理伤害后，10％机率让敌人受到沉默。",0],
[365,7,"火焰妖卡","击倒魔物时，机率额外掉落食品类物品。(未实装)",0],
[366,1,"石炮火树卡",0,8,10,17,10,0],
[367,4,"单眼虫卡","受到物理伤害后，5％机率让敌人受到石化。<BR>基本INT77以上时，石化机率改为15％。",0],
[368,3,"梅纳海葵卡",0,50,30,0],
[369,5,"蝗虫之王卡",0,19,3,0],
[370,7,"妖道卡","使用狂击技能时，将敌人击退5格。<BR>从魔物[僵尸],受到的伤害，增加100%。(未实装)",221,19800601,0],
[371,7,"冰波利卡","击倒魔物时，20％机率额外掉落杰勒比结晶、和0.1％机率额外掉落巨大杰勒比结晶。",0],
[372,5,"波利王卡",0,6,1,0],
[373,10,"蚁后卡",0,0],
[374,2,"狂暴蚁后卡","可以看到隐匿和伪装的对象。(包括玩家。)以全身黑色显示。",0],
[375,3,"弑神者卡",0,18,1,190,25,0],
[376,2,"邪恶礼盒卡","击倒魔物时，0.3％机率额外掉落礼物箱。",0],
[377,6,"狂暴小恶魔卡",0,122,10,52,-20,0],
[378,7,"邪恶箱卡","击倒魔物时，0.1％机率额外掉落神秘箱子。",0],
[379,6,"米雅毕卡",0,16,10,5055,5,0],
[380,1,"半龙人卡","习得火球术Lv10时，施展火球术Lv10。",17,15,221,19805203,0],
[381,6,"邪恶摩艾卡","鞋子精炼度5以下时，MDEF+7。",0],
[382,1,"熔岩巨石卡",0,84,30,0],
[383,2,"飞行魔书卡","服事系列角色装备时，INT+1，MDEF+1。",4,1,0],
[384,4,"瑞比欧卡","受到物理伤害后，5％机率让敌人受到昏眩。<BR>基本DEX77以上时，晕眩机率改为15％。",0],
[385,7,"恶灵卡","击倒不死种族时，机率额外掉落：啼笑的箱子。",0],
[386,7,"幽灵弓箭手卡","击倒恶魔种族时，机率额外掉落：怨恨的箱子。",0],
[387,2,"狂暴大脚熊卡","击倒动物种族时，机率额外掉落火灵矿石。",63,10,0],
[388,6,"奈吉鸟卡",0,1,1,3,1,0],
[389,7,"人蔘精卡","击倒植物种族时，机率额外掉落红色药草、黄色药草、白色药草。<BR>吃下药草类物品时，HP恢复量增加50%。",0],
[390,1,"直升机哥布灵卡",0,70,10,115,7,0],
[391,6,"狂暴野猫卡","盗贼系列角色装备时，完全回避+5。",2,1,0],
[392,4,"塔奥群卡",0,15,100,18,-50,19,-50,0],
[393,5,"妖君卡",0,9,15,10,1,0],
[394,5,"恶魔波利卡",0,60,50,61,-50,62,-50,63,-50,64,-50,65,-50,66,-50,67,-50,68,-50,69,-50,0],
[395,7,"舞狮卡",0,2,1,10,3,0],
[396,3,"塔噜安卡",0,18,2,5158,10,5159,10,5384,10,0],
[397,2,"群叶猫卡","击倒鱼贝种族时，机率额外掉落水灵矿石。",61,10,0],
[398,1,"狐仙卡",0,48,20,0],
[399,6,"铁蝎卡",0,120,10,50,-20,0],
[400,5,"废气魔卡",0,60,10,78,10,0],
[401,5,"暗●弓箭手卡","精炼值が4以下の时、さらにFlee+10、完全回避+1",9,10,0],
[402,5,"小青卡","精炼值によりLUKとクリティカル确率が增加",6,-5,0],
[403,5,"兽人婴儿卡","精炼值が9以上の场合、さらに无属性攻击耐性+5%、Flee+5",60,10,9,10,0],
[404,5,"暗●十字刺客艾勒梅斯卡",0,230,108203,0],
[405,5,"爱丽俄卡","装备者が剑士、商人、シーフ系列である场合、STR+2、最大HP+5%<BR>装备者がマジシャン、アコライト、アーチャー系列である场合、INT+2、最大SP+5%",0],

[406,6,"达纳托斯的憎恶卡","精炼值によりAGIが增加",2,-5,0],
[407,6,"俄希托斯卡","精炼值が4以下の场合、さらに最大HP+4%、最大SP+4%<BR>HP自然回复量+5%、SP自然回复量+5%",15,4,16,4,0],
[408,6,"绿贝勒斯卡",0,3,1,15,10,0],
[409,6,"嗒妮小姐卡","モンスターを倒す度に、低确率でバナナを落とす<BR>バナナの回复量+100%",15,-50,16,50,0],
[410,7,"小妖精卡","动物型モンスターを倒す度に、一定确率でボンバーステーキ(STR+3)を落とす",0],
[411,7,"恶魔之眼卡",0,230,122501,0],
[412,7,"疟蚊卡","昆虫型モンスターを倒す度に、一定确率で触手のチーズグラタン(AGI+3)を落とす",0],
[413,7,"暗●盗贼卡",0,231,19817401,0],
[414,7,"暗●服事卡",0,231,69803201,0],
[415,7,"等离子体卡","モンスターを倒す度に、一定确率でレジストポーションを落とす",0],
[416,7,"代行刑者卡","天使型モンスターを倒す度に、一定确率で大学芋(LUK+3)を落とす",0],
[417,7,"龙蛋卡","龙族モンスターを倒す度に一定确率でハチ蜜ハーブティー(INT+3)を落とす",0],
[418,7,"绿变色龙卡","无形型モンスターを倒す度に一定确率でフルーツミックス(DEX+3)を落とす",0],
[419,7,"三头龙卡",0,231,19922701,0],
[420,4,"RSX-0806卡","着用者はノックバックしない、铠が损伤されない",3,3,0],
[421,4,"暗●神官玛嘉雷特卡",0,231,109826701,0],
[422,4,"迪塔勒泰晤勒斯卡",0,152,100,231,90523801,0],
[423,6,"暗●剑士 赛尼亚卡","10秒ごとにHPを50、SPを10回复。",15,10,16,10,0],
[424,2,"暗●超魔导师凯特莉娜卡","一般モンスターの魔法防御力を无视する。<BR>装备解除时、SPが2000程度消失する",73,100,76,-100,0],
[425,2,"贝思波卡","魔法攻击时、ボスモンスターのMDEFの 30%を无视してダメージを与える。",5,2,0],
[426,2,"暗●神官卡",0,4,1,231,91510105,0],
[427,1,"达纳托斯的苦恼卡","魔法攻击时、天使型モンスターに10%の追加ダメージ",0],
[428,1,"褐方体恶魔卡","魔法攻击时、恶魔型モンスターに2%の追加ダメージ",0],
[429,100,0,"(インジャスティスCを2枚以上挿しても效果は增えません)",17,20,6,3,0],
[430,100,0,"オートスペルのフロストダイバー发动确率が大きく增加",0],
[431,100,0,"水栖种族を倒した时に特定の确率で贝を落とす。",44,30,0],
[432,100,0,0,18,3,19,3,0],
[433,100,0,0,4,4,3,4,75,30,76,30,0],
[434,100,0,0,73,-20,15,20,16,20,0],
[435,100,0,0,1,3,0],
[436,100,0,0,18,3,3,3,0],
[437,100,0,0,86,20,0],
[438,100,0,"近接物理ダメージを受けた场合15%の确率で敌に睡眠をかける",0],
[439,100,0,"近接物理ダメージを受けた场合15%の确率で敌に暗暗をかける",0],
[440,100,0,"近接物理ダメージを受けた场合15%の确率で敌に咒いをかける",0],
[441,100,0,0,7,1,0],
[442,100,0,0,9,18,0],
[443,100,0,0,9,18,0],
[444,100,0,0,9,18,0],
[445,100,0,0,9,18,0],
[446,100,0,0,9,18,0],
[447,100,0,0,9,18,0],
[448,100,0,0,13,300,14,60,0],
[449,100,0,0,221,19805605,0],
[450,100,0,"打倒敌人时低机率掉落红色药水。<BR>套装装备者为剑士系列时，使用红/黄/白色药水时的回复量+50%。",1,10,15,20,75,50,231,19815301,0],
[451,100,0,"移动速度+5%<BR>攻击时回复SP1。<BR>不施展自动性的胁持。<BR>套装装备者为盗贼系列时，使用技能时不消耗魔力矿石。",1,5,2,5,12,5,0],
[452,100,0,"SP消耗-10%。<BR>套装装备者为服事系列时，被恶魔种族/不死种族魔物攻击伤害减少30%<BR>打倒恶魔种族/不死种族魔物时，得到的经验值增加5%",3,10,73,-10,0],
[453,100,0,"套装装备者为弓箭手系列<BR>打倒动物种族魔物时，得到的经验值增加5%<BR>物理攻击时，一定机率让动物种族魔物陷入濒死状态。",25,20,2,5,5,3,86,20,0],
[454,100,0," 套装装备者为魔法师系列时，咏唱时间减少15%，MATK+3%",13,500,18,5,19,5,5051,10,5054,10,5056,10,0],
[455,100,0,"攻击时回复SP2<BR>套装装备者为商人系列时<BR>打倒魔物时一定机率掉落神秘紫箱，魔法反射机率增加20%。",6,10,5065,20,0],
[456,100,0,"セット装备者がクルセイダーの场合、铠に圣属性を付与する",1,1,4,1,18,2,75,10,73,-10,5324,10,5284,10,0],
[457,100,0,"ストリップアーマーLv5を习得している场合オートスペルでLv5が发动<BR>セット装备者がローグである场合、<BR>スキル使用时SP消费量-20%、<BR>オートスペルインティミデイトが发动しない",1,6,2,4,5169,10,0],
[458,100,0,"セット装备者がモンクの场合<BR>スキル使用时SP消费量-10%、咏唱が中断されない",1,3,17,25,14,80,5197,10,5321,10,231,19702905,0],
[459,100,0,"セット装备者がバードかダンサーの场合、<BR>物理攻击を受けた时、一定确率でオートスペル[运命のタロットカード]Lv2发动",5,5,5199,10,5207,10,5292,5,0],
[460,100,0,"セット装备者がセージである场合、<BR>20%の确率で魔法反射、<BR>咏唱时间-20%、<BR>モンスターを倒す度に低确率でレッド?イエロージェムストーンを落とす",4,3,5057,10,5133,10,0],
[461,100,0,"攻击する度にSP1回复<BR>セット装备者がアルケミストの场合<BR>物理攻击时一定确率でオートスペル[アドレナリンラッシュ]Lv1发动<BR>モンスターを倒す度に一定确率でコーティング药、植物の茎を落とす",1,4,15,7,16,7,5065,20,0],
[462,1,"茅膏菜卡","遠距離物理攻撃の時CRI+15",0],
[463,1,"阿特罗修卡","物理攻撃時、一定確率で10秒間攻撃速度+100%(計算機未計算)",17,25,0],
[464,1,"机械剑士卡","片手剣か両手剣の時、ボウリングバッシュのダメージ+25%、CRI+5、HIT+5",0],
[465,1,"机械狙击手卡","弓の時、アローシャワーのダメージ+50%、CRI+5、HIT+5",0],
[466,1,"亡灵巫师卡","杖の時、INT+1、敵のMDEF2%無視",0],
[467,3,"邪恶妖精卡","物理or魔法ダメージを受けた時に一定確率で10秒間完全回避+30(計算機未計算)",190,15,191,15,192,15,0],
[468,3,"搜索者卡",0,220,104901,159,30,19,10,0],
[469,3,"邪恶噬人花卡",0,231,79802501,231,79802701,0],
[470,3,"火焰颅骨卡","近距離物理攻撃を受けた時、一定確率で敵にスタン、呪い、暗黒、石化のうち一つをかける",151,30,153,30,154,30,159,30,0],
[471,2,"凡贝尔克卡","物理攻撃時、一定確率で5秒間CRI+100(計算機未計算)",1,2,0],
[472,2,"依斯拉卡","魔法攻撃時、一定確率で5秒間キャスティング時間が50%減少し、Flee+30(計算機未計算)",4,2,0],
[473,2,"敲击者卡","無形モンスターを倒した時低確率でエルニウム原石、オリデオコン原石ドロップ",30,5,0],
[474,2,"女妖卡片","マジシャン系列の場合、SP+100、HP-100<BR>ナパームビート、ソウルストライク、ナパームバルカンのダメージ+20%",0],
[475,4,"影魔卡",0,46,40,47,40,38,40,36,40,0],
[476,4,"阿加波卡","着用者がマジシャン系列の場合追加でSP+100",89,5,18,-10,0],
[477,4,"艾基奥卡","着用者が剣士系列の場合追加でHP+500",17,15,0],
[478,4,"寒冰龙卡",0,43,50,221,109813010,0],
[479,4,"狂徒卡(暂)","ローグ、チェイサーが装着時ATK+10%、MATK+10%<BR>(※計算機ではATK+10%はサイン系で計算中)",0],
[480,5,"鼬卡",0,9,5,11,3,41,10,115,15,0],
[481,5,"熔岩蜥蜴卡",0,5122,40,5125,40,0],
[482,5,"不死鸟卡",0,221,19805105,221,19805205,0],
[483,5,"熔岩波利卡",0,17,5,42,10,112,15,113,15,0],
[484,6,"寒冰巨人卡","物理/魔法ダメージを受けた時一定確率で10秒間DEF+10(計算機未計算)",3,2,0],
[485,6,"僵尸屠戮者卡","モンスターを倒した時HP50回復",37,1,177,1,0],
[486,6,"堕落的大神官卡",0,89,10,16,-50,177,50,178,50,0],
[487,7,"雪怪卡","モンスターを倒した時高確率でアイスクリームを落とす<BR>アイスクリームの回復量100%増加",0],
[488,7,"小雪怪卡","コールドボルトのキャスティング時間25%減少",5054,25,0],
[489,7,"寒冰雕像卡",0,221,19805402,0],
[490,7,"疯狂鬣狗卡",0,8,5,41,5,0],
[491,7,"石头波利卡",0,220,102101,220,102201,0],
[492,7,"伊夫利特卡","ATK、CRI、HITが自分のJobレベルに対する一定の割合で増加する。(Jobレベル10毎に1増加)<BR>物理攻撃を受けた時、一定確率でアースクエイク発動。",0],
[493,7,"熔岩魔卡","ファイアーボルトのキャスティング時間25%減少",5051,25,0],
[494,7,"变异僵尸卡","低確率で自分に状態異常出血<BR>ゾンビスローターカードとともに装着時、人間型モンスターを倒した時SP2回復",117,5,37,1,177,1,0],
[495,7,"地狱犬卡","にくの回復量100%増加<BR>近距離物理攻撃時、相手に低確率で出血をかける",8,1,0],
];

CardNum = 495;

CardSortOBJ = [
[0,201,202,203,204,1,2,3,106,156,107,223,463,25,11,233,235,10,244,158,27,252,253,254,255,259,26,263,265,15,277,279,39,14,286,287,288,289,290,43,109,22,296,31,428,9,29,16,313,18,162,34,160,38,464,41,319,311,323,427,165,325,326,328,329,28,169,20,215,42,47,343,32,21,462,5,164,466,345,305,24,45,159,46,353,355,171,356,13,37,167,4,110,359,360,19,361,217,33,163,44,366,17,12,465,6,161,166,40,35,23,30,380,398,8,157,36,382,168,363,7,111,170,390,219,"NULL"],
[0,1,2,3,106,156,107,223,463,25,11,233,235,10,244,158,27,252,253,254,255,259,26,263,265,15,277,279,39,14,286,287,288,289,290,43,109,22,296,31,428,9,29,16,313,18,162,34,160,38,464,41,319,311,323,427,165,325,326,328,329,28,169,20,215,42,47,343,32,21,462,5,164,466,345,305,24,45,159,46,353,355,171,356,13,37,167,4,110,359,360,19,361,217,33,163,44,366,17,12,465,6,161,166,40,35,23,30,380,398,8,157,36,382,168,363,7,111,170,390,219,"NULL"],
[0,221,472,234,471,48,238,239,425,174,49,52,117,177,357,116,273,274,114,284,298,176,213,303,113,309,180,320,51,337,339,342,50,473,347,424,474,120,179,332,426,115,374,118,376,119,175,383,397,387,178,"NULL"],
[0,154,222,122,231,124,54,55,241,245,126,249,57,61,468,306,307,310,173,396,56,53,272,348,58,358,60,470,172,368,467,62,469,127,375,125,123,63,59,"NULL"],
[0,190,420,476,224,225,133,232,193,187,75,189,240,477,282,194,134,191,138,185,132,261,197,264,268,478,334,299,275,276,475,280,281,136,283,285,69,291,293,70,129,301,302,181,333,308,66,195,74,128,317,321,392,214,198,422,330,331,67,131,344,135,421,130,349,65,479,71,364,199,73,367,182,196,64,183,137,184,384,186,192,68,72,220,"NULL"],
[0,404,86,76,243,405,85,403,482,401,258,267,271,79,294,295,481,82,80,402,327,394,338,340,341,400,346,78,352,393,139,369,83,483,372,84,81,87,77,480,"NULL"],
[0,399,484,227,228,229,140,94,242,95,246,89,486,257,266,408,269,278,407,300,304,91,93,485,318,322,406,88,351,362,92,423,90,377,379,381,388,409,391,"NULL"],
[0,230,188,492,414,493,236,412,237,141,247,248,250,251,152,148,256,260,262,490,212,97,270,146,418,410,489,226,103,292,297,416,395,151,488,491,312,487,314,96,145,315,316,100,98,324,335,336,417,419,149,216,350,354,144,411,413,105,415,365,495,142,147,150,370,371,143,101,378,104,102,494,218,385,386,99,389,"NULL"]
];
for(i=0;CardSortOBJ[0][i]!="NULL";i++)
	document.calcForm.A_weapon1_card1.options[i] = new Option(cardOBJ[CardSortOBJ[0][i]][2],cardOBJ[CardSortOBJ[0][i]][0]);
for(i=0;CardSortOBJ[1][i]!="NULL";i++){
	document.calcForm.A_weapon1_card2.options[i] = new Option(cardOBJ[CardSortOBJ[1][i]][2],cardOBJ[CardSortOBJ[1][i]][0]);
	document.calcForm.A_weapon1_card3.options[i] = new Option(cardOBJ[CardSortOBJ[1][i]][2],cardOBJ[CardSortOBJ[1][i]][0]);
	document.calcForm.A_weapon1_card4.options[i] = new Option(cardOBJ[CardSortOBJ[1][i]][2],cardOBJ[CardSortOBJ[1][i]][0]);
}
document.calcForm.A_weapon1_card4.options[4] = new Option("惢憿儔儞僋TOP10",106);

for(i=0;CardSortOBJ[2][i]!="NULL";i++){
	document.calcForm.A_head1_card.options[i] = new Option(cardOBJ[CardSortOBJ[2][i]][2],cardOBJ[CardSortOBJ[2][i]][0]);
	document.calcForm.A_head2_card.options[i] = new Option(cardOBJ[CardSortOBJ[2][i]][2],cardOBJ[CardSortOBJ[2][i]][0]);
}
for(i=0;CardSortOBJ[3][i]!="NULL";i++)
	document.calcForm.A_left_card.options[i] = new Option(cardOBJ[CardSortOBJ[3][i]][2],cardOBJ[CardSortOBJ[3][i]][0]);
for(i=0;CardSortOBJ[4][i]!="NULL";i++)
	document.calcForm.A_body_card.options[i] = new Option(cardOBJ[CardSortOBJ[4][i]][2],cardOBJ[CardSortOBJ[4][i]][0]);
for(i=0;CardSortOBJ[5][i]!="NULL";i++)
	document.calcForm.A_shoulder_card.options[i] = new Option(cardOBJ[CardSortOBJ[5][i]][2],cardOBJ[CardSortOBJ[5][i]][0]);
for(i=0;CardSortOBJ[6][i]!="NULL";i++)
	document.calcForm.A_shoes_card.options[i] = new Option(cardOBJ[CardSortOBJ[6][i]][2],cardOBJ[CardSortOBJ[6][i]][0]);
for(i=0;CardSortOBJ[7][i]!="NULL";i++){
	document.calcForm.A_acces1_card.options[i] = new Option(cardOBJ[CardSortOBJ[7][i]][2],cardOBJ[CardSortOBJ[7][i]][0]);
	document.calcForm.A_acces2_card.options[i] = new Option(cardOBJ[CardSortOBJ[7][i]][2],cardOBJ[CardSortOBJ[7][i]][0]);
}

function Click_Card(CBI)
{
	ActiveSkillSetPlus();

	if(eval(document.calcForm.ITEM_SW.checked)==0)
		return;
	for(i=0;i<=4;i++)
		myInnerHtml("ITEM"+i,"",0);
	myInnerHtml("ITEM_W_LV","",0);
	myInnerHtml("ITEM_DATA","",0);
	myInnerHtml("ITEM_SLOT","",0);
	myInnerHtml("ITEM_LV","",0);
	myInnerHtml("ITEM_WAIT","",0);

	if(CBI == 106){
		myInnerHtml("nm080","星星的角 or  锻造排名TOP10",0);
		myInnerHtml("B_SETUMEI","一个星星的角伤害+5<BR>三个星星的角伤害+40<BR>锻造排名TOP10伤害+10<BR>(锻造排名TOP10位于卡片最右边的选项栏位)",0);
		return;
	}
	if(201 <= CBI && CBI <= 204){
		myInnerHtml("nm080",cardOBJ[CBI][2],0);
		myInnerHtml("B_SETUMEI","武器 "+ ZokuseiOBJ[CBI-200] +"属性",0);
		return;
	}
	myInnerHtml("nm080",cardOBJ[CBI][2] +"卡",0);

	CBIstr = "";
	for(i=4;cardOBJ[CBI][i] != 0;i+=2)
		Item_Setumei(cardOBJ[CBI][i],cardOBJ[CBI][i+1]);
	if(cardOBJ[CBI][3] != 0)
		CBIstr += cardOBJ[CBI][3] +"<BR>";

	var check = 0;
	for(var i=4;cardOBJ[CBI][i] != 0;i+=2){//僙僢僩愢柧扵嶕
		if(cardOBJ[CBI][i] == 90){
			CBIstr += "<Font size=2><BR><B>"+ SetCardName(cardOBJ[CBI][i+1]);
			var w = w_SC[cardOBJ[CBI][i+1]][0];
			while(cardOBJ[CBI][i+2] != 0 && check == 0){
				if(w == w_SE[cardOBJ[CBI][i+3]][0]){
					CBIstr += "或<BR>"+ SetCardName(CardOBJ[CBI][i+3]);
					i += 2;
				}else
					check = 1;
			}
			CBIstr += "同时装备时<BR>";
			check = 0;
			for(var j=4;cardOBJ[w][j] != 0;j+=2)//僙僢僩愢柧扵嶕
				Item_Setumei(cardOBJ[w][j],cardOBJ[w][j+1]);
			if(cardOBJ[w][3] != 0)
				CBIstr += cardOBJ[w][3] +"<BR>";
			CBIstr += "</Font></B>";
		}
	}

	myInnerHtml("B_SETUMEI",CBIstr,0);
}

w_SC = [[429,306,235,"NULL"],//僕儖僞僗
[430,349,305,"NULL"],//僴僥傿乕
[431,254,259,356,"NULL"],//僇僯僸僩僨
[432,229,280,352,"NULL"],//傾儔儉僋儘僢僋
[433,291,234,"NULL"],//僒僉儏僀儞僉儏
[434,322,320,"NULL"],//僟乕僋儘乕僪
[435,273,98,"NULL"],//僞儘僂
[436,274,73,"NULL"],//儁僐
[437,245,40,"NULL"],//儅儈乕
[438,9,308,"NULL"],//僗働儖僩儞
[439,58,276,"NULL"],//孎
[440,50,344,"NULL"],//僫僀僩儊傾
[441,125,370,393,"NULL"],//儉僫
[442,294,10,"NULL"],//楾+偝偡傜偄
[442,341,88,"NULL"],//僪儔僑儞僼儔僀+僠儑儞僠儑儞
[442,243,7,"NULL"],//僄僋儕+儖僫僥傿僢僋
[442,372,64,"NULL"],//儅僗僞儕儞+億儕儞
[442,369,68,"NULL"],//儃乕僇儖+儘僢僇乕
[442,338,72,"NULL"],//僩乕僪+儘僢僇乕
[448,218,212,"NULL"],//儖乕僪+僉儏乕僽
[449,248,247,"NULL"],//僆僂儖
[450,223,317,347,354,362,"NULL"],//寱
[451,233,295,391,395,260,"NULL"],//搻
[452,253,383,307,301,270,"NULL"],//惞
[453,279,224,340,351,230,"NULL"],//媩
[454,337,358,220,346,379,350,"NULL"],//杺
[455,326,376,281,388,216,"NULL"],//彜
[456,190,347,354,362,"NULL"],//僋儖僙
[457,413,113,295,391,260,"NULL"],//儘乕僌
[458,253,383,181,270,"NULL"],//儌儞僋
[459,279,408,224,340,230,"NULL"],//棆捁
[460,337,193,346,379,350,"NULL"],//僙乕僕
[461,326,175,281,388,104,"NULL"],//働儈
];
SC_MAXnum = 32;
for(var i=0;i<=SC_MAXnum;i++){
	for(var k=1;w_SC[i][k] != "NULL";k++){
		for(var j=4;cardOBJ[w_SC[i][k]][j] != 0;j+=2);
		cardOBJ[w_SC[i][k]][j]=90;
		cardOBJ[w_SC[i][k]][j+1]=i;
		cardOBJ[w_SC[i][k]][j+2]=0;
	}
}

function SetCardName(SENw){//僙僢僩憰旛偺柤慜傪傑偲傔偰曉偡
	var SENstr = "";
	for(var i=0;i<=SC_MAXnum;i++){
		if(i == SENw){
			for(var j=1;w_SC[i][j] != "NULL";j++){
				SENstr += "【"+ cardOBJ[w_SC[i][j]][2] +"C】";
				if(w_SC[i][j+1] != "NULL")
					SENstr += "＋";
			}
			return SENstr;
		}
	}
}
// 僇乕僪僙僢僩傪敪尒偟丄偁偭偨傜憰旛16～25斣栚偲偟偰捛壛
function SetCard()
{
	for(var i=16;i<=25;i++)
		n_A_card[i] = 0;//嬻偺僙僢僩

	var w_SE_num= 16;
	var w_SE_ch = 0;
	for(var k=0;k<=SC_MAXnum;k++){
		for(var j=1;w_SC[k][j] != "NULL" && (w_SE_ch == 1 || (w_SE_ch == 0 && j == 1));j++){
			w_SE_ch = 0;
			for(var i=0;i<=15 && w_SE_ch == 0;i++){
				if(n_A_card[i] == w_SC[k][j])
					w_SE_ch = 1;
			}
		}
		if(w_SE_ch == 1){
			n_A_card[w_SE_num] = w_SC[k][0];
			w_SE_num++;
		}
	}
}
